In [31]:
import pandas as pd

In [32]:
l = [4,8,15,16,23,42]

In [33]:
data = pd.Series(l)

In [34]:
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [35]:
list1 = ["Sujeet", "Kumar", "Pwskills", "Data Science Masters 2.0", "Python", "MySql", "Libraries", "Pandas", "Numpy", "pw.live"]

In [36]:
pandas_list = pd.Series(list1)

In [37]:
pandas_list

0                      Sujeet
1                       Kumar
2                    Pwskills
3    Data Science Masters 2.0
4                      Python
5                       MySql
6                   Libraries
7                      Pandas
8                       Numpy
9                     pw.live
dtype: object

In [38]:
data = [["Alice", 25, "Female"], ["Bob", 30, "Male"], ["Claire", 27, "Female"]]

In [39]:
DataFrame = pd.DataFrame(data, columns = ["Name", "Age", "Gender"])

In [40]:
print(DataFrame)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [41]:
# What is DataFrame in Pandas : A dataframe is 2 dimensional data structure like 2D list.
# How it is different from pandas.series : A data frame is 2 dimensional data structure consisting of rows and columns and series is a 1 dimensional data structure used to represent used to represent single column or row.

In [42]:
# We can drop columns and Rows from the data, We can rename a column in the dataset

In [43]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [44]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [45]:
data_dropped = df.drop('Age', axis=1)

In [20]:
# DataFrame and Panel are mutable data type.

In [49]:
Courses = pd.Series(['datascience', 'Decode with C++', 'Decode with Java'], name = "Courses")
fees = pd.Series([3500, 5999, 5999], name = "Fees")
date = pd.Series(["20 Feb 2023", "15 Dec 2023", "1 Feb 2024"], name = "Launch Date")

In [29]:
Courses

0         datascience
1     Decode with C++
2    Decode with Java
dtype: object

In [50]:
df2 = pd.concat([Courses, fees, date], axis = 1)

In [51]:
df2

            Courses  Fees  Launch Date
0       datascience  3500  20 Feb 2023
1   Decode with C++  5999  15 Dec 2023
2  Decode with Java  5999   1 Feb 2024